---
kind: method
id: M:Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIData.GetUnits
source: html/311af0f1-71c0-b048-6e41-e62b80df136c.htm
---
# Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIData.GetUnits Method

Gets units.

## Syntax (C#)
```csharp
public Units GetUnits()
```

## Returns
The Units object.